<?php

$error_msgs = [
  "name" => [
    "empty" => [
      "title" => 'Введите имя'
    ]
  ],

  "surname" => [
    "empty" => [
      "title" => 'Введите фамилию'
    ]
  ],

  "email" => [
    "empty" => [
      "title" => 'Введите email'
    ],

    "empty_with_explanation" => [
      "title" => "Введите email",
      "desc" => "Email обязателен для регистрации, входа на сайт или восстановления пароля"
    ],

    "invalid" => [
      "title" => "Введите корректный email"
    ],

    "incorrect" => [
      "title" => "Неверный email"
    ],

    "not_exist" => [
      "title" => "Несуществующий email"
    ],

    "registered" => [
      "title" => "Данный email уже зарегистрирован",
      "desc" => "Используйте другой email или воспользуйтесь <a href=" . HOST . 'lost-password' . " ?>восстановлением пароля</a>"
    ]
  ],

  "password" => [
    "empty" => [
      "title" => "Введите пароль длиной не менее 4 символов!"
    ],

    "incorrect" => [
      "title" => "Неверный пароль"
    ]
  ],

  "registration" => [
    "failed" => [
      "title" => "Что-то пошло не так",
      "desc" => "Повторите регистрацию"
    ],
  ],

  "setting_new_password" => [
    "failed" => [
      "title" => "Что-то пошло не так",
      "desc" => "Повторите процедуру сброса пароля ещё раз"
    ]
  ],

  "secret_code" => [
    "incorrect" => [
      "title" => "Секретный код неверен",
      "desc" => "Перейдите ещё раз по ссылке из полученного email или повторите процедуру восстановления пароля ещё раз"
    ]
  ],

  "file" => [
    "small" => [
      "title" => "Загрузите другую фотографию",
      "desc" => "Размеры для аватара должны быть не меньше 160x160px"
    ],

    "heavy" => [
      "title" => "Превышен объём файла",
      "desc" => "Максимальный объём файла изображения 4 Мб"
    ],

    "format_invalid" => [
      "title" => "Неверный формат файла",
      "desc" => "Допускается загрузка только .jpg, jpeg, .gif, .png"
    ],

    "upload_failed" => [
      "title" => "Что-то пошло не так...",
      "desc" => "Загрузите фото ещё раз"
    ],

    "not_saved" => [
      "title" => "Ошибка сохранения файла",
      "desc" => "Повторите загрузку фото"
    ]
  ],

  "comment" => [
    "empty" => [
      "title" => 'Введите комментарий'
    ],

    "not_saved" => [
      "title" => "Ошибка сохранения комментария",
      "desc" => "Повторите отправку комментария ещё раз"
    ]
  ],

  "message" => [
    "empty" => [
      "title" => 'Введите сообщение!'
    ],
  ]
];

$success_msgs = [
  "email" => [
    "sent" => [
      "title" => "Проверьте почту",
      "desc" => "Вам был отправлен email со ссылкой для сброса пароля"
    ]
  ],

  "new_password" => [
    "set" => [
      "title" => "Пароль успешно обновлён"
    ]
  ],

  "comment" => [
    "set" => [
      "title" => "Комментарий успешно добавлен"
    ]
  ],

  "message" => [
    "sent" => [
      "title" => "Сообщение успешно отправлено!"
    ]
  ]
];
